import React, { Component } from 'react';
import { 
  AppRegistry, 
  ListView, 
  Text, 
  View,  
  TouchableHighlight } from 'react-native';

class ListView extends React.Component {
  // Initialize the hardcoded data
  constructor(props) {
    super(props);
    const ds = new ListView.DataSource({rowHasChanged: (r1, r2) => r1 !== r2});
    this.state = {
      dataSource: ds.cloneWithRows([
        'ทางการแพทย์'
      ])
    };
  }
  render() {
    return (
      <View style={{flex: 1, paddingTop: 22}}>
        <ListView
          dataSource={this.state.dataSource}
          renderRow={(rowData) => <Text>{rowData}</Text>}
        />
      </View>
      <View>
        <TouchableHighlight onPress={() =>{
          this.setModalVisible(false)
        Text: [
            {'name': 'โรงพยาบาลกล้วยน้ำไท', 'tel': '0-2381-2006-20'},
            {'name': 'โรงพยาบาลกรุงเทพ', 'tel': '1719'},
            {'name': 'โรงพยาบาลกรุงเทพ จันทบุรี (เกาะช้าง)', 'tel': '0-3931-9888'},
            {'name': 'โรงพยาบาลกรุงเทพ ระยอง', 'tel': '0-3892-1999'},
            {'name': 'โรงพยาบาลกรุงเทพ พัทยา', 'tel': '0-3825-9999'},
            {'nmae': 'โรงพยาบาลกรุงเทพ สมุย', 'tel': '0-7742-9500'},
            {'name': 'โรงพยาบาลกรุงเทพคริสเตียน', 'tel': '0-2233-6981-9'},
            {'name': 'โรงพยาบาลกรุงธน', 'tel': '0-2438-0040-5'},
            {'name': 'โรงพยาบาลเกษมราษฎร์ ประชาชื่น', 'tel': '0-2910-1600'},
            {'name': 'โรงพยาบาลเกษมราษฎร์ บางแค', 'tel': '0-2910-1600-45'},
            {'nmae': 'โรงพยาบาลเกษมราษฎร์ สุขาภิบาล 3', 'tel': '0-2729-3000'},
            {'name': 'โรงพยาบาลเกษมราษฎร์ รัตนาธิเบศร์', 'tel': '0-2594-0020-65'},
            {'name': 'โรงพยาบาลเกษมราษฎร์ ศรีบุรินทร์', 'tel': '0-5391-0999'},
            {'name': 'โรงพยาบาลขอนแก่น', 'tel': '0-4333-6789'},
            {'nmae': 'โรงพยาบาลคามิลเลียน', 'tel': '0-2185-1444'},
            {'mame': 'โรงพยาบาลจุฬารัตน์', 'tel': '0-2738-9900-9'},
            {'name': 'โรงพยาบาลเจ้าพระยา', 'tel': '0-2434-1111'},
            {'name': 'โรงพยาบาลจิตเวชขอนแก่นราชนครินทร์', 'tel': '0-4322-7422'},
            {'name': 'โรงพยาบาลจิตเวชนครสวรรค์', 'tel': '0-5626-7280'},
            {'name': 'โรงพยาบาลเซ็นทรัลเยนเนอรัล', 'tel': '0-2552-8777'},
            {'name': 'โรงพยาบาลเซนต์หลุยส์', 'tel': '0-2210-9999'},
            {'name': 'โรงพยาบาลตำรวจ', 'tel': '0-2252-8111-25'},
            {'name': 'โรงพยาบาลตราด', 'tel': '0-3953-1784-86'},
            {'name': 'โรงพยาบาลทหารเรือกรุงเทพ', 'tel': '0-2411-2089'},
            {'name': 'โรงพยาบาลไทยนครินทร์', 'tel': '0-2361-2727'},
            {'name': 'โรงพยาบาลไทยจักษุคลินิก', 'tel': '0-2416-5454'},
            {'name': 'โรงพยาบาลธนบุรี', 'tel': '0-2412-0020'},
            {'name': 'โรงพยาบาลนครธน', 'tel': '0-2416-5454'},
            {'name': 'โรงพยาบาลบางโพ', 'tel': '0-2587-0136-44'},
            {'name': 'โรงพยาบาลบางแก้ว', 'tel': '0-7469-7381-3'},
            {'name': 'โรงพยาบาลบางมด', 'tel': '0-2867-0606'},
            {'name': 'โรงพยาบาลบำรุงราษฏร์', 'tel': '0-2667-1000'},
            {'name': 'โรงพยาบาลบีเอ็นเอช', 'tel': '0-2686-2700'},
            {'name': 'โรงพยาบาลปิยะเวท', 'tel': '0-2625-6500'},
            {'name': 'โรงพยาบาลปิยะมินทร์', 'tel': '0-2316-0026-42'},
            {'name': 'สถาบันประสาทวิทยา', 'tel': '0-2354-7075-83'},
            {'name': 'โรงพยาบาลพระรามเก้า', 'tel': '0-2-202-9999'},
            {'name': 'โรงพยาบาลพญาไท 1', 'tel': '0-2640-1111'},
            {'name': 'โรงพยาบาลพญาไท 2', 'tel': '0-2617-2444'},
            {'name': 'โรงพยาบาลเพชรรัชต์', 'tel': '0-3241-7070-9'},
            {'name': 'โรงพยาบาลภูมิพลอดุลยเดช', 'tel': '0-2534-7000'},
            {'name': 'โรงพยาบาลมิชชั่น', 'tel': '0-2282-1100'},
            {'name': 'โรงพยาบาลมิชชั่น ภูเก็ต', 'tel': '0-7623-7220-6'},
            {'name': 'โรงพยาบาลยันฮี', 'tel': '0-2879-0300'},
            {'name': 'โรงพยาบาลรามคำแหง', 'tel': '0-2374 0200-16'},
            {'name': 'โรงพยาบาลลาดพร้าว', 'tel': '0-2530-2244'},
            {'name': 'โรงพยาบาลลานนา', 'tel': '0-5399-9777'},
            {'name': 'โรงพยาบาลวิภาวดี', 'tel': '0-2941-2800'},
            {'name': 'โรงพยาบาลเวชธานี', 'tel': '0-2734-0000'},
            {'name': 'โรงพยาบาลศิครินทร์', 'tel': '0-2366-9900-99'},
            {'name': 'โรงพยาบาลศรีสยาม', 'tel': '0-2944 8015-30'},
            {'name': 'โรงพยาบาลศรีสะเกษ', 'tel': '0-4561-1503'},
            {'name': 'โรงพยาบาลสงฆ์', 'tel': '0-2354-4310'},
            {'name': 'โรงพยาบาลสมิติเวช สุขุมวิท', 'tel': '0-2711-8000'},
            {'name': 'โรงพยาบาลสมิติเวช ศรีนครินทร์', 'tel': '0-2731-7000'},
            {'name': 'โรงพยาบาลสมิติเวช ศรีราชา ', 'tel': '0-3832-0300'},
            {'name': 'โรงพยาบาลเด็กสมิติเวช ', 'tel': '0-2378-9000'},
            {'name': 'โรงพยาบาลสุขุมวิท', 'tel': '0-2391-0011'},
            {'name': 'โรงพยาบาลสมเด็จพระปิ่นเกล้า', 'tel': '0-2460-0000',
            {'name': 'โรงพยาบาลสินแพทย์', 'tel': '0-2793-5099'},
            {'name': 'โรงพยาบาลกลาง', 'tel': '0-2221-6141'},
            {'name': 'โรงพยาบาลกลางกรมราชทัณฑ์', 'tel': '0-2589-5250'},
            {'name': 'โรงพยาบาลค่ายภาณุรังสี', 'tel': '0-3232-8163'},
            {'name': 'โรงพยาบาลเซ็นทรัล ปาร์ค', 'tel': '0-2312-7261-9'},
            {'name': 'โรงพยาบาลตาหูคอจมูก กรุงเทพฯ', 'tel': '0-2579-1770-4'},
            {'name': 'โรงพยาบาลธัญญารักษ์ ', 'tel': '0-2531-0080-8'},
            {'name': 'โรงพยาบาลนิติจิตเวช', 'tel': '0-2889-9191'},
            {'name': 'โรงพยาบาลบี.แคร์ เมดิคอลเซ็นเตอร์', 'tel': '0-2523-3359-71'},
            {'name': 'โรงพยาบาลพระนั่งเกล้า นนทบุรี', 'tel': '0-2527-0246'},
            {'name': 'โรงพยาบาลพระมงกุฏเกล้า', 'tel': '0-2354-7600'},
            {'name': 'โรงพยาบาลแม่สะเรียง', 'tel': '0-5362-1027'},
            {'name': 'โรงพยาบาลราชวิถี', 'tel': '0-2354-8108-9'},
            {'name': 'โรงพยาบาลเลย', 'tel': '0-4281-1541'},
            {'name': 'โรงพยาบาลศิริราช', 'tel': '0-2411-0241-9'},
            {'name': 'โรงพยาบาลศูนย์มะเร็งกรุงเทพ', 'tel': '0-2785-5716-20'},
            {'name': 'โรงพยาบาลสมเด็จพระบรมราชเทวี ณ ศรีราชา', 'tel': '0-3832-2157-9'},
            {'name': 'โรงพยาบาลสมเด็จพระยุพราชฉวาง', 'tel': '0-7548-113-5'},
            {'name': 'โรงพยาบาลสมเด็จพระยุพราชนครไทย', 'tel': '0-5538-9060-1'}

        ]

      }}>
        
    );
  }
}
const styles = StyleSheet.create ({
   container: {
      marginTop: 20,
      flex: 1,
      // height: 600,
      // alignItems: 'stretch',
      // backgroundColor: '#ffb6c1'
      backgroundColor: 'red'
   },
   listitem: {
      margin: 15,
      padding: 15,
      height: 40,
      borderColor: 'red',
      borderWidth: 1

   }
});
